#Задание 1
list_1 = [x ** 2 for x in range(1,11)]
print(f"Квадраты чисел от 1 до 10: {list_1}")

#Задание 2
list_2 = [x for x in range(1,20) if x % 2 == 0]
print(f"Чётные числа от 1 до 20: {list_2}")